/***************** (C) COPYRIGHT  风驰iCreate嵌入式开发工作室 ******************
 * 文件名  ：tim1_ic.h
 * 描述    ：输入捕捉TIM1配置库
 * 实验平台：iCreate STM8开发板
 * 库版本  ：V2.0.0
 * 作者    ：风驰  QQ:779814207
 * 博客    ：
 * 修改时间 ：2011-12-20
*******************************************************************************/
#ifndef __TIM1_PWM_H
#define __TIM1_PWM_H
/* 包含系统头文件 */

/* 包含自定义头文件 */
#include "stm8s.h"

/* 自定义新类型 */

/* 自定义宏 */
#define GetPulseNum 20
/* 全局变量定义 */

extern u16 BPeriod;
extern u16 FrequencyArray[GetPulseNum];

extern u16 AverageFrequency;
/*******************************************************************************
 * 名称: TIM1_Input_Capture
 * 功能: TIM1输入捕捉初始化操作
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void TIM1_Input_Capture(void);
/*******************************************************************************
 * 名称: Get_IC_Frequency
 * 功能: 得到输入捕捉计数值
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
u16 Get_IC_Frequency(u8 channel);
/*******************************************************************************
 * 名称: Get_IC_Frequency
 * 功能: 将计数值存入数组
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
void Get_FrequencyArray(u16 FrequencyArray[], u8 times,u8 channel);
/*******************************************************************************
 * 名称: Sort
 * 功能: 对计数值进行排序
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
static void Sort(u16 array[],u8 n);
/*******************************************************************************
 * 名称: Get_AverageFrequency
 * 功能: 对计数值进行滤波
 * 形参: 无
 * 返回: 无
 * 说明: 无 
 ******************************************************************************/
u16 Get_AverageFrequency(u16 GetFrequency[],u8 n);

#endif

/*************** (C) COPYRIGHT 风驰iCreate嵌入式开发工作室 *****END OF FILE****/